; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	thermograph2 - mode
	thermograph0 - mode
	image1 - mode
	thermograph3 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image1)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation3)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star2)
	(supports instrument10 thermograph3)
	(supports instrument10 image1)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star0)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 Star2)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Star2)
	(have_image Phenomenon5 image1)
	(have_image Planet6 thermograph3)
	(have_image Phenomenon7 thermograph2)
))

)

; plan
1. (turn_to satellite3 star0 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star0)
   goals met: 0 of 7
2. (switch_on instrument10 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument10)
   goals met: 0 of 7
3. (calibrate satellite3 instrument10 star0)
   added: (calibrated instrument10)
   goals met: 0 of 7
4. (turn_to satellite3 phenomenon5 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon5)
   goals met: 0 of 7
5. (turn_to satellite2 groundstation4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation4)
   goals met: 1 of 7
6. (turn_to satellite1 star2 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star2)
   goals met: 2 of 7
7. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 7
8. (take_image satellite3 phenomenon5 instrument10 image1)
   added: (have_image phenomenon5 image1)
   goals met: 4 of 7
9. (turn_to satellite3 phenomenon7 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon7)
   goals met: 4 of 7
10. (take_image satellite3 phenomenon7 instrument10 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 5 of 7
11. (turn_to satellite3 planet6 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet6)
   goals met: 5 of 7
12. (take_image satellite3 planet6 instrument10 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 6 of 7
13. (turn_to satellite3 star2 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star2)
   goals met: 7 of 7
